jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32H743/FS_NOR_PHY_STM32H743.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File    : FS_NOR_PHY_STM32H743.c
Purpose : NOR physical layer for the internal flash memory of ST STM32H743.
Literature:
  [1] RM0433 Reference manual STM32H7x3 advanced ARM-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32H7\STM32H7x3_RM0433_Rev3.pdf)
  [2] STM32H753xI Errata sheet STM32H753xI rev Y device limitations
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32H7\STM32H753_Errata_Rev2.pdf)
  [3] Data sheet STM32H742xI/G STM32H743xI/G
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32H7\DS12110_STM32H743ZG.pdf)
Additional information:
  This physical layer expects that the parameters of the internal flash
  memory such as number of wait states are configured by the application.

  The characteristics of the internal flash memory request that the
  data is written 32 bytes at a time and that the write operations
  are aligned to an 32 byte boundary. In addition, it is not possible
  to rewrite a previously programmed flash memory location without
  an erase operation in between. Because of these limitations the
  NOR driver has to be compiled with the following configuration:
    FS_NOR_CAN_REWRITE           = 0
    FS_NOR_LINE_SIZE             = 32
    FS_NOR_OPTIMIZE_HEADER_WRITE = 1
  More information about these configuration defines can be found
  in the emFile manual.

  In addition the following function calls have to be added to
  FS_X_AddDevices() in order to prevent unwanted uncorrectable
  bit errors during the low-level format operation of the
  Block Map NOR driver:

  #if FS_NOR_SKIP_BLANK_SECTORS
  FS_NOR_BM_SetBlankSectorSkip(0, 0);
  #endif
  FS_NOR_BM_SetUsedSectorsErase(0, 1);

  The flash controller generates a BusFault exception when the
  ECC detects a bit error that is not able to correct. This NOR physical
  layer comes with handling for such exceptions that has to be
  explicitly enabled by the application via the FS_NOR_PHY_HANDLE_BIT_ERRORS
  configuration define. The handling is implemented in the HardFaultHandler()
  function that has to be called in the handler of a HardFault exception.
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"
#include <stm32h743xx.h>

/*********************************************************************
*
*       Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_PHY_MAX_NUM_BYTES
  #define FS_NOR_PHY_MAX_NUM_BYTES          4   // Maximum number of bytes that can be changed at once. Permitted values 1, 2 and 4.
#endif

#ifndef   FS_NOR_PHY_HANDLE_BIT_ERRORS
  #define FS_NOR_PHY_HANDLE_BIT_ERRORS      0   // Enable/disable the handling of uncorrectable bit errors.
#endif

/*********************************************************************
*
*       Defines, fixed
*
**********************************************************************
*/

/*********************************************************************
*
*       FLASH registers
*/
#define FLASH_BASE_ADDR         0x52002000
#define FLASH_ACR               (*(volatile U32*)(FLASH_BASE_ADDR + 0x000))
#define FLASH_KEYR1             (*(volatile U32*)(FLASH_BASE_ADDR + 0x004))
#define FLASH_CR1               (*(volatile U32*)(FLASH_BASE_ADDR + 0x00C))
#define FLASH_SR1               (*(volatile U32*)(FLASH_BASE_ADDR + 0x010))
#define FLASH_CCR1              (*(volatile U32*)(FLASH_BASE_ADDR + 0x014))
#define FLASH_KEYR2             (*(volatile U32*)(FLASH_BASE_ADDR + 0x104))
#define FLASH_CR2               (*(volatile U32*)(FLASH_BASE_ADDR + 0x10C))
#define FLASH_SR2               (*(volatile U32*)(FLASH_BASE_ADDR + 0x110))
#define FLASH_CCR2              (*(volatile U32*)(FLASH_BASE_ADDR + 0x114))

/*********************************************************************
*
*       System Control Block
*/
#define SCB_BASE_ADDR           0xE000E000uL
#define SCB_CCR                 (*(volatile U32 *)(SCB_BASE_ADDR + 0xD14))    // Configuration Control Register
#define SCB_SHCSR               (*(volatile U32 *)(SCB_BASE_ADDR + 0xD24))    // HardFault Status Register
#define SCB_CFSR                (*(volatile U32 *)(SCB_BASE_ADDR + 0xD28))    // BusFault Status Register
#define SCB_HFSR                (*(volatile U32 *)(SCB_BASE_ADDR + 0xD2C))    // HardFault Status Register
#define SCB_BAFR                (*(volatile U32 *)(SCB_BASE_ADDR + 0xD38))    // BusFault Address Register

/*********************************************************************
*
*       Memory protection unit
*/
#define MPU_BASE_ADDR           0xE000ED90uL
#define MPU_TYPE                (*(volatile U32 *)(MPU_BASE_ADDR + 0x00))
#define MPU_CTRL                (*(volatile U32 *)(MPU_BASE_ADDR + 0x04))
#define MPU_RNR                 (*(volatile U32 *)(MPU_BASE_ADDR + 0x08))
#define MPU_RBAR                (*(volatile U32 *)(MPU_BASE_ADDR + 0x0C))
#define MPU_RASR                (*(volatile U32 *)(MPU_BASE_ADDR + 0x10))

/*********************************************************************
*
*       Misc. registers
*/
#define SYS_FSIZE               (*(volatile U16*)(0x1FF1E880))

/*********************************************************************
*
*       Flash control register
*/
#define CR_LOCK_BIT             0
#define CR_PG_BIT               1
#define CR_SER_BIT              2
#define CR_PSIZE_BIT            4
#define CR_PSIZE_8              0uL
#define CR_PSIZE_16             1uL
#define CR_PSIZE_32             2uL
#define CR_PSIZE_MASK           0x3uL
#define CR_START_BIT            7
#define CR_SNB_BIT              8
#define CR_SNB_MASK             0x7uL

/*********************************************************************
*
*       Flash status register
*/
#define SR_BSY_BIT              0
#define SR_QW_BIT               2
#define SR_EOP_BIT              16
#define SR_WRPERR_BIT           17
#define SR_PGSERR_BIT           18
#define SR_STRBERR_BIT          19
#define SR_INCERR_BIT           21
#define SR_OPERR_BIT            22
#define SR_RDPERR_BIT           23
#define SR_RDSERR_BIT           24
#define SR_SNECCERR_BIT         25
#define SR_DBECCERR_BIT         26
#define SR_CRCEND_BIT           27

/*********************************************************************
*
*       Flash unlock keys
*/
#define KEYR_KEY1               0x45670123
#define KEYR_KEY2               0xCDEF89AB

/*********************************************************************
*
*       MPU defines
*/
#define CTRL_ENABLE_BIT         0
#define CTRL_PRIVDEFENA_BIT     2
#define RNR_REGION_MASK         0xFF
#define RASR_ENABLE_BIT         0
#define RASR_SIZE_BIT           1
#define RASR_TEX_BIT            19
#define RASR_AP_BIT             24
#define RASR_XN_BIT             28
#define RASR_AP_FULL            0x3uL
#define TYPE_DREGION_BIT        8
#define TYPE_DREGION_MASK       0xFFuL
#define RBAR_REGION_BIT         0
#define RBAR_REGION_MASK        0x1FuL
#define RBAR_VALID_BIT          5

/*********************************************************************
*
*       Misc. defines
*/
#define LD_BYTES_PER_SECTOR     17    // Size of a physical sector(power of 2 exponent).
#define CCR_DC_BIT              16
#define CCR_BFHFNMIGN_BIT       8
#define BFSR_BFARVALID_BIT      15
#define BFSR_PRECISEERR_BIT     9
#define SHCSR_BUSFAULTACT_BIT   1
#define SHCSR_BUSFAULTENA_BIT   17
#define HFSR_DEBUGEVT_BIT       31
#define GET_SR(BankIndex)       ((BankIndex == 0) ? &FLASH_SR1 : &FLASH_SR2)
#define GET_CR(BankIndex)       ((BankIndex == 0) ? &FLASH_CR1 : &FLASH_CR2)
#define GET_CCR(BankIndex)      ((BankIndex == 0) ? &FLASH_CCR1 : &FLASH_CCR2)
#define GET_KEYR(BankIndex)     ((BankIndex == 0) ? &FLASH_KEYR1 : &FLASH_KEYR2)
#define WAIT_TIMEOUT_CYCLES     300000000uL   // This is the number of cycles required to create a delay of about 7 seconds at a CPU frequency of 480 MHz

/*********************************************************************
*
*       ASSERT_DATA_IS_ALIGNED
*/
#if (FS_DEBUG_LEVEL >= FS_DEBUG_LEVEL_CHECK_ALL)
  #define ASSERT_DATA_IS_ALIGNED(Data)                                             \
    if (((Data) & (FS_NOR_LINE_SIZE - 1u)) != 0) {                                 \
      FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Data is not aligned.")); \
      FS_X_PANIC(FS_ERRCODE_INVALID_PARA);                                         \
    }
#else
  #define ASSERT_DATA_IS_ALIGNED(Data)
#endif

/*********************************************************************
*
*       ASSERT_ADDR_IS_ALIGNED
*/
#if (FS_DEBUG_LEVEL >= FS_DEBUG_LEVEL_CHECK_ALL)
  #define ASSERT_ADDR_IS_ALIGNED(pData)                                               \
    if ((SEGGER_PTR2ADDR(pData) & 3u) != 0) {                                         \
      FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Address is not aligned.")); \
      FS_X_PANIC(FS_ERRCODE_INVALID_PARA);                                            \
    }
#else
  #define ASSERT_ADDR_IS_ALIGNED(pData)
#endif

/*********************************************************************
*
*       Local data types
*
**********************************************************************
*/

/*********************************************************************
*
*       Static data
*
**********************************************************************
*/
static U16 _NumSectors;         // Total number of physical sectors in the internal flash memory.
static U32 _BytesPerSector;     // Number of bytes in a physical sector.
static U32 _BaseAddr;           // Address of the first byte in the internal flash.
static U32 _StartAddrConf;      // Address of the first byte to be used as storage as configured by the application.
static U32 _NumBytesConf;       // Number of bytes to be used as storage as configured by the application.
static U32 _StartAddrUsed;      // Address of the first byte to be used as storage aligned to a physical sector boundary.
static U32 _NumBytesUsed;       // Number of bytes to be used as storage as configured by the application.
static U16 _NumSectorsUsed;     // Number of physical sectors used as storage.

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _ld
*/
static unsigned _ld(U32 Value) {
  unsigned i;

  for (i = 0; i < 32u; i++) {
    if ((1uL << i) == Value) {
      break;
    }
  }
  return i;
}

/*********************************************************************
*
*      _CalcStorageArea
*
*  Function description
*    Determines which physical sectors are used as storage.
*/
static int _CalcStorageArea(void) {
  U16 NumSectors;
  U32 BytesPerSector;
  I32 NumBytesToSkip;
  I32 NumBytesRem;
  U32 NumBytes;
  U32 NumBytesBlock;
  U32 NumBytesSkipped;
  U8  ldBytesPerSector;
  U16 NumSectorsRem;
  U16 NumSectorsUsed;

  NumSectorsUsed   = 0;
  NumBytesToSkip   = (I32)_StartAddrConf - (I32)_BaseAddr;
  NumBytesSkipped  = 0;
  NumBytesRem      = (I32)_NumBytesConf;
  NumBytes         = 0;
  ldBytesPerSector = LD_BYTES_PER_SECTOR;
  NumSectors       = _NumSectors;
  BytesPerSector   = _BytesPerSector;
  //
  // Take care of bytes to skip before storage area.
  //
  while ((NumSectors != 0u) && (NumBytesToSkip > 0)) {
    NumBytesToSkip  -= (I32)BytesPerSector;
    NumBytesSkipped += BytesPerSector;
    NumSectors--;
  }
  if (NumSectors != 0u) {
    NumSectorsRem = (U16)((U32)NumBytesRem >> ldBytesPerSector);
    if (NumSectors > NumSectorsRem) {
      NumSectors   = NumSectorsRem;
    }
    NumBytesBlock  = (U32)NumSectors << ldBytesPerSector;
    NumBytesRem   -= (I32)NumBytesBlock;
    NumBytes      += NumBytesBlock;           // Update the actual number of bytes used as storage.
    //
    // Take care of bytes to skip after data area
    //
    if (NumSectors != 0u) {
      NumSectorsUsed += NumSectors;
    }
  }
  if (NumSectorsUsed == 0u) {
    return 1;                                 // Error, Flash size too small for this configuration
  }
  _NumSectorsUsed = NumSectorsUsed;
  _StartAddrUsed  = _BaseAddr + NumBytesSkipped;
  _NumBytesUsed   = NumBytes;
  return 0;                                   // OK, storage area determined.
}

/*********************************************************************
*
*      _CalcParallelism
*/
static U32 _CalcParallelism(U32 NumBytes) {
  switch (NumBytes) {
  default:
    // through
  case 1:
    return CR_PSIZE_8;
  case 2:
    return CR_PSIZE_16;
  case 4:
    return CR_PSIZE_32;
  }
}

/*********************************************************************
*
*      _WaitForReady
*/
static int _WaitForReady(unsigned BankIndex) {
  volatile U32 * pSR;
  U32            TimeOut;
  int            r;

  r   = 0;                // Set to indicate success.
  pSR = GET_SR(BankIndex);
  //
  // Wait for the flash memory to become ready for the operation.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((*pSR & (1uL << SR_BSY_BIT)) == 0) {
      break;
    }
    if (--TimeOut == 0u) {
      r = 1;
      break;
    }
  }
  return r;
}

/*********************************************************************
*
*      _UnlockIfRequired
*/
static int _UnlockIfRequired(unsigned BankIndex) {
  int            IsLocked;
  volatile U32 * pKEYR;
  volatile U32 * pCR;
  U32            TimeOut;

  pKEYR    = GET_KEYR(BankIndex);
  pCR      = GET_CR(BankIndex);
  IsLocked = 0;
  if ((*pCR & (1uL << CR_LOCK_BIT)) != 0u) {
    IsLocked = 1;
    *pKEYR = KEYR_KEY1;
    *pKEYR = KEYR_KEY2;
    //
    // Wait for the flash to unlock.
    //
    TimeOut = WAIT_TIMEOUT_CYCLES;
    for (;;) {
      if ((*pCR & (1uL << CR_LOCK_BIT)) == 0u) {
        break;
      }
      if (--TimeOut == 0u) {
        break;
      }
    }
  }
  return IsLocked;
}

/*********************************************************************
*
*      _Lock
*/
static void _Lock(unsigned BankIndex) {
  volatile U32 * pCR;
  U32            TimeOut;

  pCR   = GET_CR(BankIndex);
  *pCR |= 1uL << CR_LOCK_BIT;
  //
  // Wait for the flash to lock.
  //
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    if ((*pCR & (1uL << CR_LOCK_BIT)) != 0u) {
      break;
    }
    if (--TimeOut == 0u) {
      break;
    }
  }
}

/*********************************************************************
*
*      _WaitForEndOfOperation
*/
static int _WaitForEndOfOperation(unsigned BankIndex) {
  int            r;
  U32            Status;
  volatile U32 * pSR;
  U32            TimeOut;

  r       = 1;            // Set to indicate failure.
  pSR     = GET_SR(BankIndex);
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = *pSR;
    if ((Status & (1uL << SR_QW_BIT)) == 0u) {
      break;
    }
    if (--TimeOut == 0u) {
      break;
    }
  }
  if ((Status & (1uL << SR_WRPERR_BIT)) != 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Flash is write-protected).\n"));
  } else if ((Status & (1uL << SR_PGSERR_BIT)) != 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Sequence error).\n"));
  } else if ((Status & (1uL << SR_STRBERR_BIT)) != 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Strobe error).\n"));
  } else if ((Status & (1uL << SR_INCERR_BIT)) != 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Inconsistency error).\n"));
  } else if ((Status & (1uL << SR_OPERR_BIT)) != 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Operation error).\n"));
  } else if (TimeOut == 0u) {
    FS_DEBUG_ERROROUT((FS_MTYPE_DRIVER, "NOR_STM32H743: Flash operation failed (Timeout).\n"));
  } else {
    r = 0;
  }
  return r;
}

/*********************************************************************
*
*      _CalcSectorIndex
*
*  Function description
*    Calculates the index of the sector by the byte offset.
*/
static U32 _CalcSectorIndex(U32 Off) {
  U32 SectorIndex;

  SectorIndex = Off >> LD_BYTES_PER_SECTOR;
  return SectorIndex;
}

/*********************************************************************
*
*      _CalcBankIndex
*
*  Function description
*    Calculates the index of the bank by the sector index.
*/
static unsigned _CalcBankIndex(U32 SectorIndex) {
  U32      NumSectorsBank;
  unsigned BankIndex;

