jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32H743/FS_NOR_PHY_STM32H743.c
  pCR = GET_CR(BankIndex);
  *pCR &= ~((1uL           << CR_PG_BIT) |
            (CR_PSIZE_MASK << CR_PSIZE_BIT));
}

/*********************************************************************
*
*      _WriteOff
*
*  Function description
*    Writes data to internal flash memory.
*
*  Parameters
*    Off        Byte offset to write to.
*    pData      Data to be written.
*    NumBytes   Number of bytes to be written.
*
*  Return value
*    ==0    OK, data was written.
*    !=0    An error occurred.
*
*  Additional information
*    NumBytes has to be multiple of 32 value because this is the
*    number of bytes protected by one ECC parity check.
*/
static int _WriteOff(U32 Off, const void * pData, unsigned NumBytes) {
  int         IsLocked;
  int         r;
  unsigned    BankIndex;
  U32       * pWrite;
  U32         Addr;
  const U32 * pData32;
  unsigned    NumItems;
  U32         SectorIndex;

  //
  // Calculate the address to write to.
  //
  Off         += _StartAddrUsed - _BaseAddr;      // Byte offset relative to beginning of the flash memory.
  SectorIndex  = _CalcSectorIndex(Off);
  BankIndex    = _CalcBankIndex(SectorIndex);
  Addr         = _BaseAddr + Off;                 // Absolute address in system memory.
  pWrite       = SEGGER_ADDR2PTR(U32, Addr);
  pData32      = SEGGER_PTR2PTR(const U32, pData);
  //
  // Wait for the flash controller to become ready.
  //
  (void)_WaitForReady(BankIndex);
  //
  // If required, unlock the access to control register.
  //
  IsLocked = _UnlockIfRequired(BankIndex);
  //
  // Initiate the write operation.
  //
  _EnableProgram(BankIndex);
  //
  // Write the data one flash word (32 bytes) at a time.
  //
  NumItems = NumBytes >> 2;
  for (;;) {
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    *pWrite++ = *pData32++;
    //
    // Make sure that the data is written to memory.
    //
    __ISB();
    __DSB();
    NumItems -= 8;
    r = _WaitForEndOfOperation(BankIndex);
    if (r != 0) {
      break;                                      // Error, could not write data.
    }
    if (NumItems == 0) {
      break;                                      // OK, all data was written.
    }
  }
  //
  // Disable the programming operation.
  //
  _DisableProgram(BankIndex);
  //
  // If required, lock again the access to the control register.
  //
  if (IsLocked != 0) {
    _Lock(BankIndex);
  }
  return r;
}

/*********************************************************************
*
*      _ReadOff
*
*  Function description
*    Read data from flash memory and handles the bit errors.
*/
static int _ReadOff(U32 Off, void * pData, U32 NumBytes) {
  const void   * pRead;
  U32            Addr;
  U32            SectorIndex;
  unsigned       BankIndex;
  volatile U32 * pSR;
  int            r;

  r     = 0;                                      // Set to indicate success.
  Addr  = _StartAddrUsed + Off;
  pRead = SEGGER_ADDR2PTR(const void, Addr);
  FS_MEMCPY(pData, pRead, NumBytes);
  //
  // Check for uncorrectable bit errors.
  //
  Off         += _StartAddrUsed - _BaseAddr;      // Byte offset relative to beginning of the flash memory.
  SectorIndex  = _CalcSectorIndex(Off);
  BankIndex    = _CalcBankIndex(SectorIndex);
  pSR = GET_SR(BankIndex);
  if ((*pSR & (1uL << SR_DBECCERR_BIT)) != 0) {
    r = 1;                                        // Error, uncorrectable bit error detected.
  }
  return r;
}

/*********************************************************************
*
*      Public code (through callback)
*
**********************************************************************
*/

/*********************************************************************
*
*      _PHY_WriteOff
*
*  Function description
*    This routine writes data into any section of the flash.
*
*  Return value
*    ==0    O.K., data has been written
*    !=0    An error occurred
*
*  Parameters
*    Unit         Index of the physical layer.
*    Off          Byte offset relative to beginning of the region
*                 used as storage where to store the first byte.
*    pData        [OUT] Data to be written to storage device.
*    NumBytes     Number of bytes to be written.
*
*  Additional information
*    This function does not check if the section to be written
*    has been previously erased. This is in the responsibility
*    of the NOR driver. It has to be able to write data into
*    multiple sectors at a time.
*/
static int _PHY_WriteOff(U8 Unit, U32 Off, const void * pData, U32 NumBytes) {
  int r;

  ASSERT_DATA_IS_ALIGNED(Off | NumBytes);
  ASSERT_ADDR_IS_ALIGNED(pData);
  FS_USE_PARA(Unit);
  r = 0;                                // Set to indicate success.
  if (NumBytes != 0u) {
    r = _WriteOff(Off, pData, NumBytes);
  }
  return r;
}

/*********************************************************************
*
*       _PHY_ReadOff
*
*  Function description
*    Reads a number of bytes from the specified byte offset.
*
*  Parameters
*    Unit         Index of the physical layer.
*    pData        [OUT] Data read from storage device.
*    Off          Byte offset relative to beginning of the region
*                 used as storage of the first byte to be read.
*    NumBytes     Number of bytes to be read.
*
*  Return value
*    ==0    O.K., data has been read from flash.
*    !=0    An error occurred.
*/
static int _PHY_ReadOff(U8 Unit, void * pData, U32 Off, U32 NumBytes) {
  int r;

  FS_USE_PARA(Unit);
  r = _ReadOff(Off, pData, NumBytes);
  return r;
}

/*********************************************************************
*
*      _PHY_EraseSector
*
*  Function description
*    Erases one physical sector.
*
*  Parameters
*    Unit         Index of the physical layer.
*    SectorIndex  Index of the physical sector to be erased.
*
*  Return value
*    ==0    OK, sector was successfully erased.
*    !=0    Error, sector could not be erased.
*
*  Additional information
*    SectorIndex is relative to the StartAddr configured
*    by the application via _PHY_Configure(). The the sector
*    located at the address StartAddr has the index 0,
*    the index of the sector located at StartAddr + SectorSize
*    has the index 1 and so on.
*/
static int _PHY_EraseSector(U8 Unit, unsigned int SectorIndex) {
  int r;

  FS_USE_PARA(Unit);
  r = _EraseSector(SectorIndex);
  return r;
}

/*********************************************************************
*
*       _PHY_GetSectorInfo
*
*  Function description
*    Returns the parameters of the specified physical sector.
*
*  Parameters
*    Unit         Index of the physical layer.
*    SectorIndex  Index of the physical sector relative to the first
*                 sector used a storage.
*    pOff         [OUT] Offset of the first byte in the physical sector
*                 relative to beginning of the region used as storage.
*                 pOff is set to NULL if the NOR driver does not require
*                 this parameter.
*    pLen         [OUT] Number of bytes in the specified physical sector.
*                 pLen is set to NULL if the NOR driver does not require
*                 this parameter.
*
*  Additional information
*    SectorIndex can be different than the index of the actual physical
*    sector if a StartAddr larger than BaseAddr is specified in the call
*    to _PHY_Configure().
*    The NOR driver can request either both parameters or only one of them.
*/
static void _PHY_GetSectorInfo(U8 Unit, unsigned int SectorIndex, U32 * pOff, U32 * pLen) {
  FS_USE_PARA(Unit);
  FS_USE_PARA(SectorIndex);
  if (pOff != NULL) {
    *pOff = SectorIndex << LD_BYTES_PER_SECTOR;
  }
  if (pLen != NULL) {
    *pLen = _BytesPerSector;
  }
}

/*********************************************************************
*
*       _PHY_GetNumSectors
*
*  Function description
*    Returns the number of physical sectors that can be used for data storage.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Additional information
*    The number of sectors can be smaller than the total number of
*    sectors in the storage device if _PHY_Configure() is called with StartAddr
*    larger than BaseAddr or NumBytes is smaller than the total capacity
*    of the storage device.
*/
static int _PHY_GetNumSectors(U8 Unit) {
  FS_USE_PARA(Unit);
  return (int)_NumSectorsUsed;
}

/*********************************************************************
*
*       _PHY_Configure
*
*  Function description
*    Configures a single instance of the driver
*
*  Parameters
*    Unit         Index of the physical layer.
*    BaseAddr     Address of the first byte in the storage device.
*    StartAddr    Address of the first byte to be used as storage.
*    NumBytes     Number of bytes to be used as storage.
*
*  Additional information
*    If required, the function is responsible to align StartAddr
*    and NumBytes to a physical sector boundary. StartAddr has to
*    be aligned to the next ascending physical sector boundary.
*    NumBytes has to be aligned to the next descending physical
*    sector boundary.
*/
static void _PHY_Configure(U8 Unit, U32 BaseAddr, U32 StartAddr, U32 NumBytes) {
  FS_USE_PARA(Unit);
  FS_DEBUG_ASSERT(FS_MTYPE_DRIVER, StartAddr >= BaseAddr);
  _BaseAddr      = BaseAddr;
  _StartAddrConf = StartAddr;
  _NumBytesConf  = NumBytes;
}

/*********************************************************************
*
*       _PHY_OnSelectPhy
*
*  Function description
*    This function is called during the initialization after
*    this physical layer is assigned to NOR driver.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Additional information
*    This is the place where physical layer can get information
*    about the storage device.
*/
static void _PHY_OnSelectPhy(U8 Unit) {
  FS_USE_PARA(Unit);
  //
  // Nothing to do here.
  //
}

/*********************************************************************
*
*       _PHY_Init
*
*  Function description
*    Initializes the physical layer.
*
*  Parameters
*    Unit         Index of the physical layer.
*
*  Return value
*    ==0      OK, physical layer initialized.
*    !=0      An error occurred.
*
*  Additional information
*    This function is optional. If not present, the physical layer
*    has to be initialized at the first call to one of the following
*    functions:
*    - _PHY_WriteOff
*    - _PHY_ReadOff
*    - _PHY_EraseSector
*    - _PHY_GetSectorInfo
*    - _PHY_GetNumSectors
*/
static int _PHY_Init(U8 Unit) {
  U32 FlashSize;
  int r;

  FS_USE_PARA(Unit);
  //
  // Determine the characteristics of the internal flash memory.
  //
  FlashSize   = SYS_FSIZE;                        // The SYS_FSIZE register stores the number of Kbytes.
  FlashSize <<= 10;                               // Calculate the total number of bytes in the internal flash memory.
  //
  // Calculate the total number of physical sectors
  // and the sector size as well as the address
  // of the first byte to be used as storage.
  //
  _BytesPerSector = 1uL       << LD_BYTES_PER_SECTOR;
  _NumSectors     = FlashSize >> LD_BYTES_PER_SECTOR;
  r = _CalcStorageArea();
  //
  // Make sure that the access to the flash region
  // used as storage are not cached.
  //
  _DisableDCache();
  return r;
}

/*********************************************************************
*
*       Public functions
*
**********************************************************************
*/

#if FS_NOR_PHY_HANDLE_BIT_ERRORS

/*********************************************************************
*
*       HardFaultHandler
*
*  Function description
*    Handler for bit error exceptions.
*
*  Parameters
*    pStack     Value of the stack pointer.
*
*  Additional information
*    The flash controller generates a BusFault exception when
*    the ECC detects an uncorrectable bit error. We catch and ignore
*    here the BusFault exception and let _ReadOff() return an error to
*    the NOR driver. This function is the C part of the HardFault handler
*    which is called by the assembler implementation of the handler.
*/
void HardFaultHandler(unsigned int * pStack);
void HardFaultHandler(unsigned int * pStack) {
  //
  // In case we received a hard fault because of a breakpoint instruction, we return.
  // This may happen when using semihosting for printf outputs and no debugger is connected,
  // i.e. when running a "Debug" configuration in release mode.
  //
  if (SCB_HFSR & (1u << HFSR_DEBUGEVT_BIT)) {
    SCB_HFSR |=  (1u << HFSR_DEBUGEVT_BIT);                     // Reset HardFault status.
    //
    // PC is located on stack at SP + 24 bytes. Increment PC to skip break instruction.
    //
    *(pStack + 6u) += 2u;
    return;                                                     // Return to interrupted application.
  }
  //
  // Handle BusFault exceptions generated by the flash controller.
  //
  if ((SCB_CFSR & (1uL << BFSR_BFARVALID_BIT)) != 0) {
    U32            pc;
    unsigned int * pPC;
    const U16    * pInst;
    unsigned       InstType;
    unsigned       InstSize;

    //
    // The flash controller generates only precise BusFault exceptions
    // in case of an uncorrectable bit error.
    //
    if ((SCB_CFSR & (1uL << BFSR_PRECISEERR_BIT)) != 0) {
      //
      // Check that the address where the BusFault exception occurred is in the range used by the file system.
      //
      if (   (SCB_BAFR >= _StartAddrUsed)
          && (SCB_BAFR <  (_StartAddrUsed + _NumBytesUsed))) {
        //
        // Calculate the size of instruction that generated the HardFault.
        // From the ARM v7-M Architecture Reference Manual:
        //   If bits [15:11] of the halfword being decoded take any of the following values,
        //   the halfword is the first halfword of a 32-bit instruction:
        //   - 0b11101.
        //   - 0b11110.
        //   - 0b11111.
        //  Otherwise, the halfword is a 16-bit instruction.
        InstSize = 2;                                           // Assume a 16-bit instruction.
        pPC   = pStack + 6u;                                    // PC that generated the exception is located on stack at SP + 24 bytes.
        pc    = *pPC;
        pInst = SEGGER_ADDR2PTR(const U16, pc);
        InstType   = *pInst;
        InstType >>= 11;
        if (   (InstType == 0x1Du)
            || (InstType == 0x1Eu)
            || (InstType == 0x1Fu)) {
          InstSize = 4;                                         // This is a 32-bit instruction.
        }
        //
        // Increment the PC to skip the load instruction that caused the exception.
        //
        *pPC += InstSize;
        return;                                                 // Return to interrupted application.
      }
    }
  }
  //
  // Wait here for the target to be reset.
  //
  for (;;) {
    ;
  }
}

#endif // FS_NOR_PHY_HANDLE_BIT_ERRORS

/*********************************************************************
*
*       Global data
*
**********************************************************************
*/

/*********************************************************************
*
*       FS_NOR_PHY_STM32L4R5
*/
const FS_NOR_PHY_TYPE FS_NOR_PHY_STM32H743 = {
  _PHY_WriteOff,
  _PHY_ReadOff,
  _PHY_EraseSector,
  _PHY_GetSectorInfo,
  _PHY_GetNumSectors,
  _PHY_Configure,
  _PHY_OnSelectPhy,
  NULL,
  NULL,
  _PHY_Init
};

/*************************** End of file ****************************/
